# ItogovayaMainBlock
*Задача*
-
   Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. 
Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма.

*Структура кода*
-
1. Метод ввода элементов для созданиямассива(Prompt)
2. Метод вывода массива(PrintArray)
3. Метод сортировки элементов в новый массив(CkeckArrayElements)
4. Использование методов для создания,сортировки и вывода массивов

*Метод ввода элементов для создания массива(Prompt)*
-
Я создал метод типа string[ ] ( в качестве аргумента - строка с обращением к пользователю) для создания массива и чтобы пользователь мог ввести все элементы сразу я использовал метод .Split(), а в качестве разделителя указал запятую.И вернул в качестве результата сам массив.
Подразумевается,что исключение при котором пользователь будет играться с вводом данных не предусмотрено.

*Метод вывода массива(PrintArray)*
-
Я создал функции типа void с аргументом в виде запрашиваемого  массива и использовал вместе с Console.WriteLine метод string.Join( , ), чтобы сэкономить время.

*Метод сортировки элементов в новый массив(CkeckArrayElements)*
-
Я создал функцию типа string[ ] с аргументом в виде запрашиваемого  массива. Я создал массив NewArray[ ] с длиной,равной длине исходного массива, куда я буду записывать строки,удовлетворяющие условию. Также я создал счётчик count, чтобы записать количество элементов,удовлетворяющих условию,чтобы после использовать его для конечного массива с нужными элементами(без нулевых элементов).
После я начал проверять запрашиваемое условие для элементов массива в цикле,увеличивая заодно счётчик count. Каждый элемент исходного массива,удовлетворяющего условию,я записывал в новый массив, а после - записал в финальный,чтобы не было пустых строк.

*Использование методов для создания,сортировки и вывода массивов*
-
После я применял методы в *основной* части кода-создал исходный массив,отсортировал его и вывел на экран обе его вариации.